ecdr/elua/src/platform/sam34/platform.c
// eLua Platform-dependent functions
// AT91SAM3/4

#include "platform.h"
#include "type.h"
#include "devman.h"
#include "genstd.h"
#include <reent.h>
#include <errno.h>
#include <string.h>
#include <ctype.h>
#include <stdio.h>

#include "platform_conf.h"
#include "common.h"
#include "math.h"
#include "diskio.h"
#include "lua.h"
#include "lauxlib.h"
#include "lrotable.h"
#include "elua_int.h" 

#ifdef BUILD_UIP
#include "uip_arp.h"
#include "elua_uip.h"
#include "uip-conf.h"
#endif

#ifdef BUILD_ADC
#include "elua_adc.h"
#endif

// Platform specific includes


/*
 * Include header files for all drivers that have been imported from
 * Atmel Software Framework (ASF).
 */
#include <asf.h>
#include <assert.h>

// NOTE: when using virtual timers, SYSTICKHZ and VTMR_FREQ_HZ should have the
// same value, as they're served by the same timer (the systick)
#define SYSTICKHZ 10

#if (SYSTICKHZ < 6)
// SAM3X8E - SYSTICKHZ must be greater than system clock/16777215 (SysTick_LOAD_RELOAD_Msk)
// (i.e. >5 for system clock 84MHz)
#warning SYSTICKHZ too small
#endif 

#if (VTMR_NUM_TIMERS > 0)
#if (SYSTICKHZ != VTMR_FREQ_HZ)
#warning SYSTICKHZ and VTMR_FREQ_HZ should have the same value
#endif
#endif // VTMR_NUM_TIMERS > 0


typedef struct _sam_pin_config {
  uint32_t pin;
  const uint32_t flags;
  } sam_pin_config;

// Interrupt priorities (0 is highest)
//#define RAND_INT_PRI  8
//#define CAN_INT_PRI   
//#define ADC_INT_PRI   

// ****************************************************************************
// Platform initialization

// forward
static void pios_init( void );
static void spis_init( void );
static void uarts_init( void );
static void timers_init( void );


#if NUM_PWM > 0
static void pwms_init( void );
#endif

#ifdef BUILD_ADC
void ADC_Handler( void );
static void adcs_init( void );
#endif

#ifdef BUILD_CAN
void can_common_handler(u8 id);

static void cans_init( void );
#endif

#ifdef BUILD_USB_CDC
static void usb_init( void );

void platform_usb_cdc_send( u8 data );
int platform_usb_cdc_recv( timer_data_type timeout );

#endif

#ifdef BUILD_I2C
static void i2cs_init( void );
#endif

int platform_init()
{
  // Set the clocking to run from PLL
  sysclk_init();

  board_init();		// Atmel Software Framework

  // Setup PIO
  pios_init();

//	LED_Off(LED0_GPIO);
  platform_pio_op( 1, PIN_LED_0_MASK, PLATFORM_IO_PIN_CLEAR );  
  // Bootloader leaves LED on, so turn it off signal eLua running

  // Setup SPIs
#if NUM_SPI > 0
#warning SPI not tested
  spis_init();
#endif

  // Setup UARTs
  uarts_init();

  // Setup timers
  timers_init();

#ifdef BUILD_I2C
  // Setup I2Cs
#warning I2C/TWI not written  
  i2cs_init();
#endif // ifdef BUILD_I2C

#if NUM_PWM > 0
  // Setup PWMs
  pwms_init();
#endif

#ifdef BUILD_ADC
  // Setup ADCs
#warning ADC not written  
  adcs_init();
#endif

#ifdef BUILD_CAN
  // Setup CANs
#warning CAN not done
  cans_init();
#endif

#ifdef BUILD_USB_CDC
  // Setup USB
  usb_init();
#endif


#if defined(PLATFORM_HAS_SYSTIMER) && defined(SYSTICKHZ)
  // Setup system timer
  	if (SysTick_Config(platform_cpu_get_frequency() / ((u32) SYSTICKHZ)))
      return PLATFORM_ERR;    // SysTick error
#endif //SYSTIMER

  cmn_platform_init();

  // All done
  return PLATFORM_OK;
}


// ****************************************************************************
// PIO

const u32 pio_id[] =     { ID_PIOA, ID_PIOB, ID_PIOC, ID_PIOD };
Pio * const pio_base[] = { PIOA,    PIOB,    PIOC,    PIOD };

#ifdef PROTECT_PINS
// PIN_C0 - erase button

// Don't absolutely have to protect these, since startup with special function
// C0 = 1 on startup will erase, and JTAG active on startup
// But for the novice/experimenter, might be well to protect from shooting in foot by reprogram console (e.g.)

// UARTRX, TX - console (unless BUILD_USBCDC) FIXME: Find macro definition for pinmask
// Could extend protection to other devices used (CAN// CANRX, TX
// JTAG/SWD lines - PB28-31

// Note: C29 connected to A28, C26 to A29

#define PROTECT_BASE  ((u32) 0)
#define PROTECT_A (PROTECT_BASE | PIN8 | PIN9 )
#define PROTECT_B (PROTECT_BASE | PROTECT_JTAG )
#define PROTECT_C (PROTECT_BASE | PROTECT_ERASE )
#define PROTECT_D PROTECT_BASE

u32 pio_protect[] = { PROTECT_A, PROTECT_B, PROTECT_C, PROTECT_D };
#endif

#define PIO_MASK_ALL  0xFFFFFFFFUL


static void pios_init(void)
{
  unsigned i;
  
  for( i = 0; i < NUM_PIO; i ++)
    pmc_enable_periph_clk(pio_id[i]);
}



// TODO: I think platform modules generally return 0 for error, though seems to vary some?

pio_type platform_pio_op( unsigned port, pio_type pinmask, int op )
{
  pio_type retval = 1; 
  Pio * base = pio_base[ port ];

    
  switch( op )
  {
    case PLATFORM_IO_PORT_SET_VALUE:
    // Is there way to write all pins (low and high) at same time?
      pio_clear(base, ~(pinmask));
      pio_set(base, pinmask);
      break;

    case PLATFORM_IO_PIN_SET:
      pio_set( base, pinmask );
      break;

    case PLATFORM_IO_PIN_CLEAR:
      pio_clear( base, pinmask );
      break;

    case PLATFORM_IO_PORT_DIR_INPUT:
      pinmask = PIO_MASK_ALL;
    case PLATFORM_IO_PIN_DIR_INPUT:
      pio_set_input( base, pinmask, DISABLE );
#warning How handle pullup?
      break;

    case PLATFORM_IO_PORT_DIR_OUTPUT:
      pinmask = PIO_MASK_ALL;
// TODO: Arduino source code says that can save power by disabling clock on a port 
//  if all pins on port are output.
// Could wait to enable clock on port until pins set as input, 
//  and disable clock after all pins set as output
/* if all pins are output, disable PIO Controller clocking, reduce power consumption */
//            if ( g_APinDescription[ulPin].pPort->PIO_OSR == PIO_MASK_ALL )
//            {
//                pmc_disable_periph_clk( pio_id[port] ) ;
//            }
//
//      pio_set_output(Pio *p_pio, const uint32_t ul_mask, const uint32_t ul_default_level,
//		const uint32_t ul_multidrive_enable,
//		const uint32_t ul_pull_up_enable)

    case PLATFORM_IO_PIN_DIR_OUTPUT:
#ifdef PROTECT_PINS
      if ((2 == port) && (pinmask & 1))
        pinmask &= (~ (u32) 1);       // PIN_C0 is erase button - do not reprogram it
#endif // PROTECT_PINS
        
      pio_set_output( base, pinmask, LOW, DISABLE, DISABLE );
#warning Need to figure settings for default level, open drain, pull up
      break;

    case PLATFORM_IO_PORT_GET_VALUE:
      retval = pio_get( base, PIO_TYPE_PIO_INPUT, PIO_MASK_ALL );
      break;

    case PLATFORM_IO_PIN_GET:
      retval = pio_get( base, PIO_TYPE_PIO_INPUT, pinmask ) ? 1 : 0;
      break;

    case PLATFORM_IO_PIN_PULLUP:
      pio_pull_up( base, pinmask, ENABLE);
      break;
      
    case PLATFORM_IO_PIN_NOPULL:
      pio_pull_up( base, pinmask, DISABLE);
      break;

    case PLATFORM_IO_PIN_PULLDOWN:    // No pulldown on this platform, so return error
    default:
      retval = 0;
      break;
  }
  return retval;
}

//void pio_set_multi_driver(Pio *p_pio, const uint32_t ul_mask,
//		const uint32_t ul_multi_driver_enable);


// ****************************************************************************
// CAN

#if defined( BUILD_CAN )

const u32 can_id[]     = { ID_CAN0, ID_CAN1 };
Can * const can_base[] = { CAN0,    CAN1 };

// Pins

#define PIN_CFG_CANRX0  {PIO_PA1_IDX, (PIO_PERIPH_A | PIO_DEFAULT)}
#define PIN_CFG_CANTX0  {PIO_PA0_IDX, (PIO_PERIPH_A | PIO_DEFAULT)}
#define PIN_CFG_CANRX1  {PIO_PB15_IDX, (PIO_PERIPH_A | PIO_DEFAULT)}
#define PIN_CFG_CANTX1  {PIO_PB14_IDX, (PIO_PERIPH_A | PIO_DEFAULT)}

const struct { sam_pin_config rx, tx; } can_pins[] = {
  {PIN_CFG_CANRX0, PIN_CFG_CANTX0}, // CAN0
  {PIN_CFG_CANRX1, PIN_CFG_CANTX1}  // CAN1
  };


