ecdr/elua/src/platform/sam34/platform.c
// Speed used in INIT
#ifndef CAN_INIT_SPEED
#define CAN_INIT_SPEED	500
#endif

// FIXME: Check CAN controller frequency - just a guess that might be CPU_FREQ
#define CANCLK CPU_FREQUENCY

can_mb_conf_t can_rx_mailbox;

// Interrupt handlers
void can_common_handler(u8 id)
{
}

void CAN0_Handler(void)
{
  can_common_handler(0);
}
  
void CAN1_Handler(void)
{
  can_common_handler(1);
}

// Setup

// FIXME: Generalize to cover both CANs
void cans_init( void )
{
  pmc_enable_periph_clk(ID_CAN0);
  can_init(CAN0, CANCLK, CAN_BPS_1000K);
// FIXME: Need to check speed - use default from above
  can_reset_all_mailbox(CAN0);
//  can_enable_interrupt(CAN0, uint32_t dw_mask)
// FIXME: What is dw_mask?

// FIXME: Need to check mailbox particulars
  can_rx_mailbox.ul_mb_idx = 0;
  can_rx_mailbox.uc_obj_type = CAN_MB_RX_MODE;
  can_rx_mailbox.ul_id_msk = CAN_MAM_MIDvA_Msk | CAN_MAM_MIDvB_Msk;
  can_rx_mailbox.ul_id = CAN_MID_MIDvA(0x00);
  can_mailbox_init(CAN0, &can_rx_mailbox);
}

// Platform 

u32 platform_can_setup( unsigned id, u32 clock )
{
  gpio_configure_pin(can_pins[id].rx.pin, can_pins[id].rx.flags);
  gpio_configure_pin(can_pins[id].tx.pin, can_pins[id].tx.flags);

  can_disable(can_base[id]);
  can_init(can_base[id], CANCLK, clock);
  can_enable(can_base[id]);
  return clock;    // FIXME: Should return clock actually set
}

// FIXME: To be written
void platform_can_send( unsigned id, u32 canid, u8 idtype, u8 len, const u8 *data )
{
  lua_assert(false);
}

// FIXME: To be written
int platform_can_recv( unsigned id, u32 *canid, u8 *idtype, u8 *len, u8 *data )
{
  lua_assert(false);
  return PLATFORM_ERR;
}

#endif


// ****************************************************************************
// SPI

// TODO: USART can also do SPI

// One SPI device can handle 4 peripherals (well actually 16, but not messing with the chip select decode)
// However ship select 3 is not brought out to header on Due
const u32 spi_id[]     = { ID_SPI0
#ifdef ID_SPI1
, ID_SPI1 
#endif
};
Spi * const spi_base[] = { SPI0
#ifdef ID_SPI1
, SPI1 
#endif
};


// Pins
#define SPI_NPCS1 'A'
#define SPI_NPCS2 'A'
#define SPI_NPCS3 'A'

// FIXME: Needs uniform way to handle pin mapping (or at least add a regular control variable)
const struct { sam_pin_config miso, mosi, spck, npcs0, npcs1, npcs2, npcs3; } spi_pins[NUM_SPI] = {
  {{SPI0_MISO_GPIO, SPI0_MISO_FLAGS}, {SPI0_MOSI_GPIO, SPI0_MOSI_FLAGS}, {SPI0_SPCK_GPIO, SPI0_SPCK_FLAGS}, 
  {SPI0_NPCS0_GPIO, SPI0_NPCS0_FLAGS},
// Alternate pins for NPCS on SPI0 (pick 1)
#if SPI0_NPCS1 == 'A'
  {SPI0_NPCS1_PA29_GPIO, SPI0_NPCS1_PA29_FLAGS},  // Cross-connect to C.26
#else
  {SPI0_NPCS1_PB20_GPIO, SPI0_NPCS1_PB20_FLAGS},  // pin A11
#endif
#if SPI0_NPCS2 == 'A'
  {SPI0_NPCS2_PA30_GPIO, SPI0_NPCS2_PA30_FLAGS},  // ?? no pin
#else
  {SPI0_NPCS2_PB21_GPIO, SPI0_NPCS2_PB21_FLAGS},  // pin 52
#endif
#if SPI0_NPCS3 == 'A'
  {SPI0_NPCS3_PA31_GPIO, SPI0_NPCS3_PA31_FLAGS}   // ?? no pin
#else
  {SPI0_NPCS3_PB23_GPIO, SPI0_NPCS3_PB23_FLAGS}   // ?? no pin
#endif
  }
#ifdef ID_SPI1
  ,  // SPI0
  {
    {SPI1_MISO_GPIO, SPI1_MISO_FLAGS},   {SPI1_MOSI_GPIO, SPI1_MOSI_FLAGS},   {SPI1_SPCK_GPIO, SPI1_SPCK_FLAGS}, 
    {SPI1_NPCS0_GPIO, SPI1_NPCS0_FLAGS}, {SPI1_NPCS1_GPIO, SPI1_NPCS1_FLAGS}, {SPI1_NPCS2_GPIO, SPI1_NPCS2_FLAGS}, 
    {SPI1_NPCS3_GPIO, SPI1_NPCS3_FLAGS}
  }   // SPI1 Port E (so not on Due)
#endif
};


static void spis_init( void )
{
  unsigned i;
  
  for (i = 0; i < NUM_SPI_DEV; i++)
  {
  pmc_enable_periph_clk(spi_id[i]); // FIXME: Is this needed? Not listed in example
  
  spi_master_init(spi_base[i]);
  }
}


// Convert number of bits to field value (range 8 to 16; 8 -> 0, 9->1, etc.;
// value is shifted left to bit field position)  See component_spi.h, e.g. SPI_CSR_BITS_8_BIT
static u32 spi_trans_bits_encode(unsigned databits)
{
  if (databits < 8)
    databits = 8;
  if (databits > 16)
    databits = 16;
  return (databits - 8) << SPI_CSR_BITS_Pos;
}


// cpol - clock polarity (0 or 1), cpha - clock phase (0 or 1)
// mode - PLATFORM_SPI_MASTER/SLAVE
u32 platform_spi_setup( unsigned id, int mode, u32 clock, unsigned cpol, unsigned cpha, unsigned databits )
{
  unsigned spi_id = id/4;
  Spi * spi_dev = spi_base[spi_id];
  unsigned spi_chan = id & 0x3;   // 3 channels per SPI device
  
#if NUM_SPI > 0
  if (mode == PLATFORM_SPI_MASTER) 
  {
    int16_t baud_div = spi_calc_baudrate_div(clock, platform_cpu_get_frequency());

    if (-1 == baud_div) {
      return 0;// Assert(0 == "Failed to find baudrate divider");
    }
    spi_set_transfer_delay(spi_dev, spi_chan, CONFIG_SPI_MASTER_DELAY_BS,  CONFIG_SPI_MASTER_DELAY_BCT);

    spi_set_bits_per_transfer(spi_dev, spi_chan, spi_trans_bits_encode(databits));
    spi_set_baudrate_div(spi_dev, spi_chan, baud_div);

    spi_configure_cs_behavior(spi_dev, spi_chan, SPI_CS_KEEP_LOW);
    spi_set_clock_polarity(spi_dev, spi_chan, cpol);   // TODO: Check polarity/phase whether values need massage
    spi_set_clock_phase(spi_dev, spi_chan, cpha);

    gpio_configure_pin(spi_pins[spi_id].miso.pin, spi_pins[spi_id].miso.flags);
    gpio_configure_pin(spi_pins[spi_id].mosi.pin, spi_pins[spi_id].mosi.flags);
    gpio_configure_pin(spi_pins[spi_id].spck.pin, spi_pins[spi_id].spck.flags);
    switch(spi_chan)  // Set up chip select pin for this channel
    {
      case 0:
        gpio_configure_pin(spi_pins[spi_id].npcs0.pin, spi_pins[spi_id].npcs0.flags);
        break;
      case 1:
        gpio_configure_pin(spi_pins[spi_id].npcs1.pin, spi_pins[spi_id].npcs1.flags);
        break;
      case 2:
        gpio_configure_pin(spi_pins[spi_id].npcs2.pin, spi_pins[spi_id].npcs2.flags);
        break;
      case 3:
        gpio_configure_pin(spi_pins[spi_id].npcs3.pin, spi_pins[spi_id].npcs3.flags);
        break;
    }
    return platform_cpu_get_frequency()/baud_div; // Return clock set
  }
  else
  { // FIXME: Need to implement slave
    return 0;
  }
#else
  return 0;
#endif
}

#define NONE_CHIP_SELECT_ID 0x0f

spi_data_type platform_spi_send_recv( unsigned id, spi_data_type data )
{
  unsigned spi_id = id/4;
  uint16_t read_data;
  uint8_t dummy = NONE_CHIP_SELECT_ID;  // Dummy argument, not used in fixed peripheral select mode
  
// result - SPI_OK or SPI_ERROR_TIMEOUT
//  if (spi_write(spi_base[id], data, dummy, false) == SPI_ERROR_TIMEOUT)
//    return ; // rest of code does not have facility to handle error returns

//  if (spi_read(spi_base[id], &read_data, &dummy) == SPI_ERROR_TIMEOUT)
//    return ;  // what?
  spi_write(spi_base[spi_id], data, dummy, false);
  spi_read(spi_base[spi_id], &read_data, &dummy);
  
  return read_data;
}


// is_select - flag (PLATFORM_SPI_SELECT_ON or OFF)
void platform_spi_select( unsigned id, int is_select )
{
  unsigned spi_id = id/4;
  unsigned spi_chan = id & 0x3;
  
  spi_set_peripheral_chip_select_value(spi_base[spi_id],
    ((PLATFORM_SPI_SELECT_ON == is_select) ? ~((0x1) << (spi_chan) ) : NONE_CHIP_SELECT_ID));
  // chip select is a 4 bit wide bit map, select the lowest line with a 0 in it
}

// TODO: If this is supposed to deslect when SPI_SELECT_OFF, then see 
// spi_deselect_device - basically adds wait until TX done before select and spi_set_lastxfer(p_spi) after;


// ****************************************************************************
// I2C / TWI

#if NUM_I2C > 0

const u32 i2c_id[]     = { ID_TWI0, ID_TWI1 };
Twi * const i2c_base[] = { TWI0,    TWI1 };


const struct { sam_pin_config data, clk; } twi_pins[] = {
  {{TWI0_DATA_GPIO, TWI0_DATA_FLAGS}, {TWI0_CLK_GPIO, TWI0_CLK_FLAGS}}, // I2C0
  {{TWI1_DATA_GPIO, TWI1_DATA_FLAGS}, {TWI1_CLK_GPIO, TWI1_CLK_FLAGS}}  // I2C1
  };


// speed - PLATFORM_I2C_SPEED_FAST, PLATFORM_I2C_SPEED_SLOW
u32 platform_i2c_setup( unsigned id, u32 speed )
{
	twi_options_t opt;
  
  pmc_enable_periph_clk(i2c_id[id]);

// Configure pins
  gpio_configure_pin(twi_pins[id].data.pin, twi_pins[id].data.flags);
  gpio_configure_pin(twi_pins[id].clk.pin,  twi_pins[id].clk.flags);
/*
  if (id == 0)
  {
    gpio_configure_pin(TWI0_DATA_GPIO, TWI0_DATA_FLAGS);
    gpio_configure_pin(TWI0_CLK_GPIO, TWI0_CLK_FLAGS);
  }
  else
  {
    gpio_configure_pin(TWI1_DATA_GPIO, TWI1_DATA_FLAGS);
    gpio_configure_pin(TWI1_CLK_GPIO, TWI1_CLK_FLAGS);
  }
*/
  
  opt.master_clk = platform_cpu_get_frequency();
	opt.speed      = speed;

  if (twi_master_init(i2c_base[id], &opt) != TWI_SUCCESS) 
    return 0;
  else
    return speed;// FIXME: should return actual speed set
}

// Address is 0..127, direction - from enum (PLATFORM_I2C_DIRECTION_TRANSMITTER, PLATFORM_I2C_DIRECTION_RECEIVER), 
// return is boolean
int platform_i2c_send_address( unsigned id, u16 address, int direction )
{
/*
	twi_packet_t packet_tx;

