ecdr/elua/src/platform/sam34/platform.c
  return PLATFORM_OK;
}


// ****************************************************************************
// Timers

const u32 timer_id[] = {ID_TC0, ID_TC1, ID_TC2};
Tc * const timer_tc[] = {TC0, TC1, TC2};

static u32 tc_num(unsigned id);
Tc * tc(unsigned id);
u32 tchannel(unsigned id);
unsigned tmr_is_enabled( unsigned id );

// TODO: See if library files provide a name for this
#define PLATFORM_TIMER_COUNT_MAX ( 0xFFFFFFFFUL )


const struct { sam_pin_config a, b; } timer_pins[] = {
// TC0 (timers 0-2)
        {{PIO_PB25B_TIOA0, (PIO_PERIPH_B | PIO_DEFAULT)}, {PIO_PB27B_TIOB0, (PIO_PERIPH_B | PIO_DEFAULT)}},
        {{PIO_PA2A_TIOA1,  (PIO_PERIPH_A | PIO_DEFAULT)}, {PIO_PA3A_TIOB1,  (PIO_PERIPH_A | PIO_DEFAULT)}},
        {{PIO_PA5A_TIOA2,  (PIO_PERIPH_A | PIO_DEFAULT)}, {PIO_PA6A_TIOB2,  (PIO_PERIPH_A | PIO_DEFAULT)}},
// TC1 (timers 3-5)
        {{PIO_PB0B_TIOA3,  (PIO_PERIPH_B | PIO_DEFAULT)}, {PIO_PB1B_TIOB3,  (PIO_PERIPH_B | PIO_DEFAULT)}},
        {{PIO_PB2B_TIOA4,  (PIO_PERIPH_B | PIO_DEFAULT)}, {PIO_PB3B_TIOB4,  (PIO_PERIPH_B | PIO_DEFAULT)}},
        {{PIO_PB4B_TIOA5,  (PIO_PERIPH_B | PIO_DEFAULT)}, {PIO_PB5B_TIOB5,  (PIO_PERIPH_B | PIO_DEFAULT)}},
// TC2 (timers 6-8)
        {{PIO_PC25B_TIOA6, (PIO_PERIPH_B | PIO_DEFAULT)}, {PIO_PC26B_TIOB6, (PIO_PERIPH_B | PIO_DEFAULT)}},
        {{PIO_PC28B_TIOA7, (PIO_PERIPH_B | PIO_DEFAULT)}, {PIO_PC29B_TIOB7, (PIO_PERIPH_B | PIO_DEFAULT)}},
        {{PIO_PD7B_TIOA8,  (PIO_PERIPH_B | PIO_DEFAULT)}, {PIO_PD8B_TIOB8,  (PIO_PERIPH_B | PIO_DEFAULT)}}
        };


// 3 timer devices, each with 3 channels

// FIXME: NUM_TC or num_tc - Pick one (if it will work, the const might be more type safe)
#define NUM_TC (sizeof(timer_id)/sizeof (u32))
const unsigned num_tc = (sizeof(timer_id)/sizeof(u32));

// Each TC has 3 timer channels
unsigned const channels_per_tc = 3;

// Indicate which module is using each timer
// TODO: Look at other modules that use timers, as timers - ADC, UART (should they also have indicator)?
// TODO: Add quadrature decoder (which uses channels 0 and 1 of corresponding TC, and channel 2, if measuring velocity)
typedef enum {
  TMODE_UNINIT = 0,
  TMODE_TIMER,
  TMODE_COUNTER,
  TMODE_PWM } timer_mode_t;

timer_mode_t tmode[ NUM_TIMER ] = { TMODE_UNINIT };  // TODO: Or should this be handled up in timer module?

u8 platform_timer_int_periodic_flag[ NUM_TIMER ] = {0};

// timer clock
// TODO: Is there an interface to read the clock so don't have to cache/compute it?
static uint32_t tmr_div[ NUM_TIMER ] = { 0 };

// TODO: Way to check if a timer is running

// Helper functions

// Return timer device number for given eLua timer ID
static inline u32 tc_num(unsigned id)
{
  return id/channels_per_tc;
}

// Return pointer to Tc for given eLua timer id
Tc * tc(unsigned id)
{
  return timer_tc[tc_num(id)];
}

// channel number from eLua timer id
u32 tchannel(unsigned id) 
{
  return (u32) id - (tc_num(id) * channels_per_tc);
}


static void timers_init()
{
  unsigned i;

  for( i = 0; i < NUM_TC; i ++ )
    pmc_enable_periph_clk(timer_id[i]);
}


static u32 plat_timer_get_clock( unsigned id )
{
/* Code for testing
	TcChannel *tc_channel;
	tc_channel = tc(id)->TC_CHANNEL + tchannel(id);
printf("getclock tmr %u, div %lu, tcclks %lu", id, tmr_div[id], (tc_channel->TC_CMR & TC_CMR_TCCLKS_Msk));
*/
  if (tmr_div[id])
    return CPU_FREQUENCY/tmr_div[id];
  else
    return 0;
}


// FIXME: Figure out what timer mode to use for each timer use (timer, counter, PWM)
//#define TC_MODE_TIMER   
//#define TC_MODE_COUNTER 
//#define TC_MODE_PWM     

static u32 plat_timer_set_clock(unsigned id, timer_data_type clock, u32 mode)
{
	static uint32_t ul_sysclk;    // FIXME: What static for?
	uint32_t tmr_tcclks;
  ul_sysclk = CPU_FREQUENCY;  /* Get system clock. */
  
  // This finds the smallest divisor such that (MCK / (DIV * 65536)) <= freq <= (MCK / DIV)
  // So it does not set a clock frequency close to what was requested
  // For instance, if you request a clock of 1,000 Hz (or anything over 640Hz), you get 42 MHz
  // This seems rather odd, given that other clock frequency options are 10.5 MHz, 656,250 Hz, or 2,625 KHz
  // TODO: Might offer option to get closest clock (e.g. define a different divisor multiplier)
  if ( tc_find_mck_divisor(clock, ul_sysclk, &(tmr_div[id]), &tmr_tcclks, ul_sysclk) )
  {
//printf("setclock %u, clock %lu, div %lu, tmr_tcclks %lu\n", id, (u32) clock, tmr_div[id], tmr_tcclks);
    tc_init(tc(id), tchannel(id), tmr_tcclks | mode);
    return plat_timer_get_clock( id );
  }
  else  // Could not find suitable divisor
  {
    tmr_div[id] = 0;
    return 0;
  }
}


// FIXME: This probably isn't right, just a stop-gap
unsigned tmr_is_enabled( unsigned id )
{
  return tmode[id] != TMODE_UNINIT;
}


// Platform functions

void platform_s_timer_delay( unsigned id, timer_data_type delay_us )
{
  timer_data_type final;  // u64?

  final = ( ( u64 )delay_us * plat_timer_get_clock( id ) ) / 1000000;

  if( final == 0) return;
  if( final > PLATFORM_TIMER_COUNT_MAX )
    final = PLATFORM_TIMER_COUNT_MAX;     // FIXME: this isn't right (copied from another platform) - should do rollover instead (on the other hand, unless use u64 for final, this test makes no sense on this platform
// TODO: stop timer, set count to 0, start timer
  tc_init( tc(id), tchannel(id), TC_CMR_WAVE);
  tc_start( tc(id), tchannel(id) );
  WAIT_WHILE( ( tc_read_cv(tc(id), tchannel(id)) < final ) );
// TODO: should probably stop the timer (?)
}


timer_data_type platform_s_timer_op( unsigned id, int op, timer_data_type data )
{
  u32 res = 0;

  data = data;  // TODO: What is this for?
  switch( op )
  {
    case PLATFORM_TIMER_OP_START:
      tc_start( tc(id), tchannel(id) );
      break;

    case PLATFORM_TIMER_OP_READ:
      res = tc_read_cv( tc(id), tchannel(id) );
      break;

    case PLATFORM_TIMER_OP_SET_CLOCK:
      // Timer mode: Wave, Clear when count reaches register C, Count up to register C, then reset
      //          | TC_IER_CPCS // Interrupt when count reaches register C
      res = plat_timer_set_clock(id, data, TC_CMR_WAVE | TC_CMR_CPCTRG | TC_CMR_WAVSEL_UP_RC );
      if (res)
        tmode[id] = TMODE_TIMER;
      break;
      
