ecdr/elua/src/platform/sam34/platform.c
    case PLATFORM_TIMER_OP_GET_CLOCK:
      res = plat_timer_get_clock( id );
      break;

    case PLATFORM_TIMER_OP_GET_MAX_CNT:
      res = PLATFORM_TIMER_COUNT_MAX;
      break;
  }
  return res;
}


// period_us - period in microseconds, if period = 0, then use maximum possible period (I think that what means)??
// type: PLATFORM_TIMER_INT_CYCLIC or PLATFORM_TIMER_INT_ONESHOT
int platform_s_timer_set_match_int( unsigned id, timer_data_type period_us, int type )
{
  u64 final;

  if( period_us == 0 )  // Might be handled by setting period_us to largest possible period and continue
  {
    tc_stop(tc(id), tchannel(id));
//    tc_disable_interrupt(tc(id), tchannel(id), TC_IDR_CPCS);   // Disable reg C interrupt (would only do if set an interrupt on counter overflow)
    tc_get_status(tc(id), tchannel(id));
    platform_timer_int_periodic_flag[ id ] = type;              // This was ignored in one example - ??
    tc_write_rc(tc(id), tchannel(id), PLATFORM_TIMER_COUNT_MAX); // Or could just drop the register C mode and go to full wave (changing interrupt type).
    // Should set CMR to CPCstop 
    tc_start( tc(id), tchannel(id) );
    return PLATFORM_TIMER_INT_OK;
  } 
  
  final = ( ( u64 )period_us * plat_timer_get_clock( id ) ) / 1000000;
  if ( final == 0 )
    return PLATFORM_TIMER_INT_TOO_SHORT;  
  if ( final > PLATFORM_TIMER_COUNT_MAX )
    return PLATFORM_TIMER_INT_TOO_LONG;
  tc_stop( tc(id), tchannel(id) );
  tc_get_status( tc(id), tchannel(id) );    // Guessing that this clears pending interrupt stats (?) - may not need
  platform_timer_int_periodic_flag[ id ] = type;
  // FIXME: Need to handle one-shot vs. continuous (stop when reaches register C, vs reset)
  // FIXME: Should be more elegant way to handle oneshot - set CMR to reset and keep going when reach CPC
  tc_write_rc( tc(id), tchannel(id), ( u32 )final );  // TODO: Check if that should be final or final - 1
  tc_start( tc(id), tchannel(id) );
  return PLATFORM_TIMER_INT_OK;
}


// *****************
// SysTick timer - interrupt SYSTICKHZ times/second

//static volatile u64 g_ms_ticks = 0;   // Workaround in case system timer doesn't work

// interrupt handler
void SysTick_Handler(void)
{
//	g_ms_ticks++;
  cmn_virtual_timer_cb();

  // System timer handling
  cmn_systimer_periodic();
}

u64 platform_timer_sys_raw_read(void)
{
//  return g_ms_ticks;
  return SysTick->LOAD - SysTick->VAL;
}

void platform_timer_sys_disable_int(void)
{
  SysTick->CTRL &= ~(SysTick_CTRL_TICKINT_Msk);   // based on core_cm3.h and stm32 platform.h
//	NVIC_DisableIRQ(SysTick_IRQn);
}

void platform_timer_sys_enable_int(void)
{
  SysTick->CTRL |= SysTick_CTRL_TICKINT_Msk;
//  NVIC_EnableIRQ(SysTick_IRQn);
}

timer_data_type platform_timer_read_sys(void)
{
  return cmn_systimer_get();
}


// ****************************************************************************

// PWMs

#if NUM_PWM > 0


const uint32_t pwm_chan[] = { PWM_CHANNEL_0, PWM_CHANNEL_1, PWM_CHANNEL_2, PWM_CHANNEL_3, 
                              PWM_CHANNEL_4, PWM_CHANNEL_5, PWM_CHANNEL_6, PWM_CHANNEL_7 };

#define PWM_MAX_CLOCK CPU_FREQUENCY

// TODO: Check PWM library see if it exports a constant to replace this
#define PWM_MAX_PERIOD  ((1<<16) - 1)


// PWM clock - master, /1,2,4,8,16,32,64,128,256,512,1024
// clocka, clockb - dividers, each can divide one of above by (1 to 255)

// PWM channel prescalers
const static u32 pwm_div_ctl[] = { PWM_CMR_CPRE_MCK,  PWM_CMR_CPRE_MCK_DIV_2,
  PWM_CMR_CPRE_MCK_DIV_4,   PWM_CMR_CPRE_MCK_DIV_8,   PWM_CMR_CPRE_MCK_DIV_16,
  PWM_CMR_CPRE_MCK_DIV_32,  PWM_CMR_CPRE_MCK_DIV_64,  PWM_CMR_CPRE_MCK_DIV_128, 
  PWM_CMR_CPRE_MCK_DIV_256, PWM_CMR_CPRE_MCK_DIV_512, PWM_CMR_CPRE_MCK_DIV_1024, 
  PWM_CMR_CPRE_CLKA,        PWM_CMR_CPRE_CLKB };

// const static u8 pwm_div_data[] = { 1, 2, 4, 8, 16, 32, 64, 128, 256, 512, 1024 };
// prescalers[11] = { 1, 2, 4, 8, 16, 32, 64, 128, 256, 512, 1024 };
#define pwm_prescalers( n ) ( 1 << (n) )

#define PWM_CLOCK_PRE_MAX  11
const unsigned nprescalers = PWM_CLOCK_PRE_MAX;

#define PWM_PRE_CLOCKA (nprescalers)
#define PWM_PRE_CLOCKB (PWM_PRE_CLOCKA+1)
#define PWM_PRE_UNUSED (PWM_CLOCK_PRE_MAX+2)

// FIXME: pwm_chan_clock and pwm_chan_pre may be redundant? (only need one or other)
// Clock each channel is using
u32 pwm_chan_clock[NUM_PWM] = { 0 };

// Prescaler used by each channel
u8 pwm_chan_pre[NUM_PWM] = { PWM_PRE_UNUSED };

// Use counters - how many channels using each custom clock (if no channels using, can change clock)
u8 pwm_clka_users = 0, pwm_clkb_users = 0;

// Frequency for custom channel clocks
pwm_clock_t pwm_clock = { .ul_clka = 0, .ul_clkb = 0 };


// void PWM_Handler(void)


/* Helper functions */

#define FREQ_EPSILON  100

// Scaler for relative difference (100 would be % difference)
#define PWM_PARTS_PER 1000

// TODO: Use relative difference, rather than absolute difference in clock selection
static int rel_diff(u32 f1, u32 f2)
{
  return (PWM_PARTS_PER * 2 * (f1 - f2)) / (f1 + f2);
}

/*
 * Helper function:
 * Find a prescaler to generate the closest available clock frequency.
 * If the configuration cannot be met (because freq is too high), set the
 * maximum frequency possible.
 */
static u32 pwm_find_clock_prescaler( u32 frequency )
{
  unsigned prescaler;	// Which of the prescalers are we considering?

  if ( frequency > PWM_MAX_CLOCK )
    return 0; // Select master clock frequency

  for (prescaler = 1; prescaler < nprescalers; prescaler++)
    if ( pwm_prescalers( prescaler ) * frequency > PWM_MAX_CLOCK)
      break;
//  Assert( max/prescalers( prescaler-1) > frequency > max/prescalers(prescaler) or prescaler = nprescalers )
//  if ( prescaler < nprescalers )    
// Taking the absolute values of the differences in following comparison handles case where prescaler==nprescalers
    if ( abs(PWM_MAX_CLOCK - frequency * pwm_prescalers( prescaler-1 )) < abs(frequency * pwm_prescalers( prescaler ) - PWM_MAX_CLOCK))
//    ABSDIFF(max, frequency * pwm_prescalers( prescaler-1 )) < ABSDIFF(max, frequency * pwm_prescalers( prescaler ))
      return prescaler - 1;
    else
      return prescaler;
}

// Return the frequency of master clock divided by 2 ^ given prescaler
static u32 freq_from_prescaler( unsigned prescaler )
{
  return PWM_MAX_CLOCK >> prescaler;
}


static int pwm_enable_pin(unsigned id);

