ecdr/elua/src/platform/sam34/platform.c
// For now - just provide a way to initialize fixed pins for PWM (where can fill in which pin to use)

u8 pwm_pin_enabled[NUM_PWM] = {false};


// set mapping PWM channel -> pin (or pin -> PWM channel)

// 8 PWMs (0-7), each have 2 outputs (H, L) [appear to be at least approximately complementary]
//   also some have one input FI (0-2)
// Output signals can be mapped to various pins
// PWMH0 - PA8(B), PB12(B), PC3(B)
// PIN_ATTR_PWM
/*  
PIO_PA5B_PWMFI0
PIO_PA3B_PWMFI1
PIO_PD6B_PWMFI2 
*/

// Alternate pin selection (FIXME: should use a general pin map at runtime)

// Define these constants to port letter of pin to be used.  
// Define to something else (e.g. nil) if don't want to use.

// TODO: Could make these selectable from the build system
//  e.g., pwm = {L0 = A, L1 = C, ...}

// Allow outside pin definition (shortcut for now - assume if define 1, then defined all)
#ifndef PWML0

// PWML0 A -> onboard LED "Tx" (low = on)
#define PWML0 'A'
#define PWML1 'C'
#define PWML2 'C'
#define PWML3 'C'
// PWML4 C -> arduino pin "PWM9"
#define PWML4 'C'
// PWML5 C -> arduino pin "PWM8"
#define PWML5 'C'
// PWML6 C -> arduino pin "PWM7"
#define PWML6 'C'
// PWML7 C -> arduino pin "PWM6"
#define PWML7 'C'

#endif

// TODO: Remove #warnings below - were just there for testing

static const sam_pin_config pwm_pins_l[] = {
#if ('A' == PWML0)
  { PIO_PA21_IDX, (PIO_PERIPH_B| PIO_DEFAULT)}, //PWML0 - onboard LED Tx (low = on?)
#elif ('B' == PWML0)
  { PIO_PB16_IDX, (PIO_PERIPH_B| PIO_DEFAULT)}, //PWML0  PIO_PB16B_PWML0
#elif ('C' == PWML0)
  { PIO_PC2_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},  //PWML0
#else
  PIN_CFG_NOPIN, 
//#warning PWML0 not used
#endif
#if ('A' == PWML1)
  { PIO_PA12_IDX, (PIO_PERIPH_B| PIO_DEFAULT)}, //PWML1
#elif ('B' == PWML1)
  { PIO_PB17_IDX, (PIO_PERIPH_B| PIO_DEFAULT)}, //PWML1
#elif ('C' == PWML1)
  { PIO_PC4_IDX,  (PIO_PERIPH_B| PIO_DEFAULT)}, //PWML1
#else
  PIN_CFG_NOPIN, 
//#warning PWML1 not used
#endif

#if ('A' == PWML2)
  { PIO_PA20_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#elif ('B' == PWML2)
  { PIO_PB18_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#elif ('C' == PWML2)
  { PIO_PC6_IDX,  (PIO_PERIPH_B| PIO_DEFAULT)},
#else
  PIN_CFG_NOPIN, 
//#warning PWML2 not used
#endif // PWML2

#if ('A' == PWML3)
  { PIO_PA0_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#elif ('B' == PWML3)
  { PIO_PB19_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#elif ('C' == PWML3)
  { PIO_PC8_IDX,  (PIO_PERIPH_B| PIO_DEFAULT)}, // PWML3
#else
  PIN_CFG_NOPIN, 
//#warning PWML3 not used
#endif // PWML3

#if ('B' == PWML4)
  { PIO_PB6_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#elif ('C' == PWML4)
  { PIO_PC21_IDX, (PIO_PERIPH_B| PIO_DEFAULT)}, // PWML4
#else
  PIN_CFG_NOPIN, 
//#warning PWML4 not used
#endif // PWML4

#if ('B' == PWML5)
  { PIO_PB7_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#elif ('C' == PWML5)
  { PIO_PC22_IDX, (PIO_PERIPH_B| PIO_DEFAULT)}, // PWML5
#else
  PIN_CFG_NOPIN, 
//#warning PWML5 not used
#endif // PWML5

#if ('B' == PWML6)
  { PIO_PB8_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#elif ('C' == PWML6)
  { PIO_PC23_IDX, (PIO_PERIPH_B| PIO_DEFAULT)}, // PWML6
#else
  PIN_CFG_NOPIN, 
//#warning PWML6 not used
#endif // PWML6

#if ('B' == PWML7)
  { PIO_PB9_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#elif ('C' == PWML7)
  { PIO_PC24_IDX, (PIO_PERIPH_B| PIO_DEFAULT)}  // PWML7
#else
  PIN_CFG_NOPIN 
//#warning PWML7 not used
#endif // PWML7
  };


#ifndef PWMH0

#define PWMH no
//#define PWMH 'C'

#define PWMH0 PWMH
#define PWMH1 PWMH
#define PWMH2 PWMH
#define PWMH3 PWMH
#define PWMH4 no
#define PWMH5 PWMH
#define PWMH6 PWMH

#endif

static const sam_pin_config pwm_pins_h[] = {
#if ('A' == PWMH0)
  { PIO_PA8_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#elif ('B' == PWMH0)
  { PIO_PB12_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#elif ('C' == PWMH0)
  { PIO_PC3_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#else
  PIN_CFG_NOPIN, 
//#warning PWMH0 not used
#endif

#if ('A' == PWMH1)
  { PIO_PA19_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#elif ('B' == PWMH1)
  { PIO_PB13_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#elif ('C' == PWMH1)
  { PIO_PC5_IDX,  (PIO_PERIPH_B| PIO_DEFAULT)},
#else
  PIN_CFG_NOPIN, 
//#warning PWMH1 not used
#endif

#if ('A' == PWMH2)
  { PIO_PA13_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#elif ('B' == PWMH2)
  { PIO_PB14_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#elif ('C' == PWMH2)
  { PIO_PC7_IDX,  (PIO_PERIPH_B| PIO_DEFAULT)},
#else
  PIN_CFG_NOPIN, 
//#warning PWMH2 not used
#endif // PWMH2

#if ('A' == PWMH3)
  { PIO_PA9_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#elif ('B' == PWMH3)
  { PIO_PB15_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#elif ('C' == PWMH3)
  { PIO_PC9_IDX,  (PIO_PERIPH_B| PIO_DEFAULT)},
#else
  PIN_CFG_NOPIN, 
//#warning PWMH3 not used
#endif // PWMH3

#if ('C' == PWMH4)
  { PIO_PC20_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#else
  PIN_CFG_NOPIN, 
//#warning PWMH4 not used
#endif // PWMH4

#if ('C' == PWMH5)
  { PIO_PC19_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#else
  PIN_CFG_NOPIN, 
//#warning PWMH5 not used
#endif // PWMH5

#if ('C' == PWMH6)
  { PIO_PC18_IDX, (PIO_PERIPH_B| PIO_DEFAULT)},
#else
  PIN_CFG_NOPIN, 
//#warning PWMH6 not used
#endif // PWMH6

  PIN_CFG_NOPIN 
  };


static int pwm_enable_pin(unsigned id)
{
  if (!pwm_pin_enabled[id]) {
		// Setup PWM for pins on this PWM
    if ( pwm_pins_l[id].pin != PIO_INVALID_IDX)
      gpio_configure_pin(pwm_pins_l[id].pin, pwm_pins_l[id].flags);
    if ( pwm_pins_h[id].pin != PIO_INVALID_IDX)
      gpio_configure_pin(pwm_pins_h[id].pin, pwm_pins_h[id].flags);
    pwm_pin_enabled[id] = true;
  }
  return 0; // Return 0 for success
}


// ********************
// PWMs provided by timers
// NUM_TIMER_PWM - number of PWMs done by timers

#define TIMER_PWM

#ifdef TIMER_PWM

#define MAX_DUTY  100

#define INVALID_PWM NUM_PWM


// TODO: Flags -> bitarray?
static u8 tc_pinEnabled[ NUM_TIMER_PWM ] = { 0 };

// TODO: merge with tmode?
// Has period been set for this timer device?
static u8 tmr_per[ NUM_TIMER ] = {0};

// Is this timer running?
static u8 tmr_running[ NUM_TIMER ] = { 0 };

// Is this channel running (a or b)
static u8 channel_running[NUM_TIMER_PWM] = { 0 };

