ecdr/elua/src/platform/sam34/platform.c
/*
static u32 tc_pwm_get_clock( unsigned id );
static u32 tc_pwm_set_clock( unsigned id, u32 clock );
static u32 tc_pwm_setup( unsigned id, u32 frequency, unsigned duty );
static void tc_pwm_start( unsigned id );
static void tc_pwm_stop( unsigned id );
*/

// Timer PWM Helper functions

// Differentiate PWMs handled by pwm vs. by timer (or other mechanism)
static bool pwm_id_is_pwm( unsigned id )
{
  return id < NUM_REAL_PWM;
}

// Map PWM id to id of timer that controls that PWM
// pwm_id -> tc (0-3), tc channel (0-3), A or B
//0: TC0, Ch0, A; 1: TC0, Ch0, B; 2: TC0, Ch1, A; TC0, Ch1, B

// FIXME: Need to clarify terms - make standard term for each of these and fix code appropriately
//  timer device number (TC0, TC1, TC2) 
//  channel number (0-3 - channel handeled by the timer device)
//  pwm_id
//  subchanel (A or B) since each timer can handle 2 PWM pins

static unsigned pwm_id_to_pwm_tc( unsigned id )
{
  if (pwm_id_is_pwm(id))
    return INVALID_PWM;
  return id - NUM_REAL_PWM;
}

static inline unsigned pwm_tc_id_to_timer_id( unsigned id )
{
  return (id >> 1);
}

//  timer_id - id number for the timer (same as in timer module) (e.g. [0-9]
static unsigned pwm_id_to_timer_id( unsigned id )
{
  return pwm_tc_id_to_timer_id(pwm_id_to_pwm_tc(id));
}

// TODO: Could do this with table lookups, which faster/better space?
static unsigned pwm_tc_id_to_timer( unsigned id )
{
  return pwm_tc_id_to_timer_id(id) / channels_per_tc;
}

static unsigned pwm_tc_id_to_channel( unsigned id )
{
  return pwm_tc_id_to_timer_id(id) - (pwm_tc_id_to_timer( id ) * channels_per_tc);
}

static bool pwm_tc_id_isA( unsigned id)
{
  return !(id & 1);
}

// If given timer counter pwm channel is A (even), return the B (channel+1), and vice-versa
static unsigned partner_channel(u32 tcid)
{
  return tcid ^ 1; // xor
}


// TODO: See how many places used, may be easy to get rid of this
static u32 tc_pwm_get_clock( unsigned id )
{
  return plat_timer_get_clock( pwm_id_to_timer_id( id ) );
}


// TODO: Add error checking on setup (so don't change timer in use for one thing to something else)
static u32 tc_pwm_set_clock( unsigned id, u32 clock )
{
  unsigned timer_id = pwm_id_to_timer_id( id );
  const u32 res = plat_timer_set_clock(timer_id, clock, 
      TC_CMR_TCCLKS_TIMER_CLOCK1 |  // FIXME: Not sure what this does
      TC_CMR_WAVE |         // Waveform mode
      TC_CMR_WAVSEL_UP_RC | // Counter running up and reset when equals to RC
      TC_CMR_EEVT_XC0 |     // Set external events from XC0 (this setup TIOB as output)
      TC_CMR_ACPA_CLEAR | TC_CMR_ACPC_CLEAR | // clear TIOA on RA and RC
      TC_CMR_BCPB_CLEAR | TC_CMR_BCPC_CLEAR); // clear TIOB on RB and RC;
// Clear on RA and RC means clear all the time (output always low)
  
  if (res)
    tmode[timer_id] = TMODE_PWM;
  return res;
}


static void tc_SetCMR_ChannelA(Tc *tc, uint32_t chan, uint32_t v)
{
	tc->TC_CHANNEL[chan].TC_CMR = (tc->TC_CHANNEL[chan].TC_CMR & 0xFFF0FFFF) | v;
}
// ~ (TC_CMR_ACPA_Msk | TC_CMR_ACPC_Msk)

static void tc_SetCMR_ChannelB(Tc *tc, uint32_t chan, uint32_t v)
{
	tc->TC_CHANNEL[chan].TC_CMR = (tc->TC_CHANNEL[chan].TC_CMR & 0xF0FFFFFF) | v;
}
// ~ (TC_CMR_BCPB_Msk | TC_CMR_BCPC_Msk)


static u32 tc_pwm_setup( unsigned id, u32 frequency, unsigned duty )
{
  const u32 tcid = pwm_id_to_pwm_tc(id);  
  Tc *chTC = tc(pwm_tc_id_to_timer(tcid));
  const uint32_t chNo = pwm_tc_id_to_channel(tcid);
  u32 period;
  u32 duty_clocks;
  const unsigned timer_id = pwm_id_to_timer_id(id);
  u32 pwmclk = tc_pwm_get_clock( id );
  
  // Check that timer set up for PWM
  if (tmode[timer_id] != TMODE_PWM)
    return 0;   // FIXME: Or whatever indicates failure

  period = (pwmclk + frequency/2) / frequency;
  if (period > PLATFORM_TIMER_COUNT_MAX) period = PLATFORM_TIMER_COUNT_MAX;
  duty_clocks = (period * duty + (MAX_DUTY/2) ) / MAX_DUTY; // duty::100 as duty_clocks::period Calculate from duty cycle
  
	if (!tmr_per[timer_id]) { 
    // Init handled by pwm_set_clock
/*    tc_init(chTC, chNo,
      TC_CMR_TCCLKS_TIMER_CLOCK1 |
      TC_CMR_WAVE |         // Waveform mode
      TC_CMR_WAVSEL_UP_RC | // Counter running up and reset when equals to RC
      TC_CMR_EEVT_XC0 |     // Set external events from XC0 (this setup TIOB as output)
      TC_CMR_ACPA_CLEAR | TC_CMR_ACPC_CLEAR | // clear TIOA on RA and RC
      TC_CMR_BCPB_CLEAR | TC_CMR_BCPC_CLEAR); // clear TIOB on RB and RC */
    tc_write_rc(chTC, chNo, period);

		tmr_per[timer_id] = true;   // FIXME: Not right yet - have we programmed it, then have we started it (so need more than 2 states, or maybe 2 separate flags)  Programmed, started
    // FIXME: also need way to clear this (e.g. clear it when change to using as timer)
	}
  else 
    // Check period against frequency currently using, if set to different freq - have a problem
    // Actually this isn't right - need to check that the other channel is in use
    // Or maybe just let them run one PWM per TC (and pick which pin they want A or B)
    if (period != tc_read_rc(chTC, chNo))
      return 0;   // FIXME: Or whatever indicates failure

  if (duty_clocks == 0) {
    if (pwm_tc_id_isA(tcid))
      tc_SetCMR_ChannelA(chTC, chNo, TC_CMR_ACPA_CLEAR | TC_CMR_ACPC_CLEAR);  // RA -> clear TIOA, RC -> clear TIOA
    else
      tc_SetCMR_ChannelB(chTC, chNo, TC_CMR_BCPB_CLEAR | TC_CMR_BCPC_CLEAR);
  } else {
    if (pwm_tc_id_isA(tcid)) {
      tc_write_ra(chTC, chNo, duty_clocks);
      tc_SetCMR_ChannelA(chTC, chNo, TC_CMR_ACPA_CLEAR | TC_CMR_ACPC_SET);  // RA -> clear TIOA, RC -> set TIOA
    } else {
      tc_write_rb(chTC, chNo, duty_clocks);
      tc_SetCMR_ChannelB(chTC, chNo, TC_CMR_BCPB_CLEAR | TC_CMR_BCPC_SET);
    }
  }
  return ( pwmclk + period/2) / period;
}


static void tc_pwm_start( unsigned id )
{
  u32 tcid = pwm_id_to_pwm_tc(id);
  const unsigned timer_id = pwm_id_to_timer_id(id);
  
  if (!tc_pinEnabled[tcid]) {
    if (pwm_tc_id_isA(tcid)) {
      if ( timer_pins[timer_id].a.pin != PIO_INVALID_IDX)
        gpio_configure_pin(timer_pins[timer_id].a.pin, timer_pins[timer_id].a.flags);
    }
    else {
      if ( timer_pins[timer_id].b.pin != PIO_INVALID_IDX)    
        gpio_configure_pin(timer_pins[timer_id].b.pin, timer_pins[timer_id].b.flags);      
    }
    tc_pinEnabled[tcid] = 1;
  };

  if (!tmr_running[timer_id]) {
    tc_start(tc(timer_id), pwm_tc_id_to_channel(tcid));
    tmr_running[timer_id] = 1;  // FIXME: Running logic not right - need timer running, and maybe channel running
  };
  if (!channel_running[tcid])
    channel_running[tcid] = 1;
}

