ecdr/elua/src/platform/sam34/platform.c
static void tc_pwm_stop( unsigned id )
{
  u32 tcid = pwm_id_to_pwm_tc(id);
  Tc *chTC = tc(pwm_tc_id_to_timer(tcid));
  const uint32_t chNo = pwm_tc_id_to_channel(tcid);
  const unsigned timer_id = pwm_id_to_timer_id(id);

  if (channel_running[tcid]){
    channel_running[tcid] = 0;
    // Stop PWM output by changing action so clears on RA and RC
    //  Tis is probably not right - if start is done by enabling output pin, then stop should be by disabling
    //    (Alternatively - make start actually set the channel A actions, then stop going to all clears would)
    if (pwm_tc_id_isA(tcid))
      tc_SetCMR_ChannelA(chTC, chNo, TC_CMR_ACPA_CLEAR | TC_CMR_ACPC_CLEAR);  // RA -> clear TIOA, RC -> clear TIOA
    else
      tc_SetCMR_ChannelB(chTC, chNo, TC_CMR_BCPB_CLEAR | TC_CMR_BCPC_CLEAR);
      
  };
  // Really what need to do is check if other pin in use, 
  //    if not, then stop the channel - and release it back to being a timer channel again
  // Check if other part of timer in use, if not stop the timer
  // Should have some way to release it for use as a counter or timer
  if (!channel_running[partner_channel(tcid)])
    if (tmr_running[timer_id]) {
      tc_stop(tc(timer_id), pwm_tc_id_to_channel(tcid));
      tmr_running[timer_id] = 0;
    };
}

#else

static bool pwm_id_is_pwm( unsigned id )
{
  return true;
}

#endif // TIMER_PWM


// Platform functions

// Assumes that timers enabled by timer section
static void pwms_init( void )
{
  pmc_enable_periph_clk(ID_PWM);
}


#define GET_FIELD(value, mask, pos) ((mask & (value)) >> pos)

//#define PWM_CLK_DIVA_GET(value) ((PWM_CLK_DIVA_Msk & (value)) >> PWM_CLK_DIVA_Pos)))
#define PWM_CLK_DIVA_GET(value) GET_FIELD(value, PWM_CLK_DIVA_Msk, PWM_CLK_DIVA_Pos)
#define PWM_CLK_DIVB_GET(value) GET_FIELD(value, PWM_CLK_DIVB_Msk, PWM_CLK_DIVB_Pos)
#define PWM_CLK_PREA_GET(value) GET_FIELD(value, PWM_CLK_PREA_Msk, PWM_CLK_PREA_Pos)
#define PWM_CLK_PREB_GET(value) GET_FIELD(value, PWM_CLK_PREB_Msk, PWM_CLK_PREB_Pos)


// pwm.c does not provide interface to fetch clock, so use low level component_pwm macros
u32 platform_pwm_get_clock( unsigned id )
{
	u32 pre;
  u32 div;
  u32 res = 0;

  if (pwm_id_is_pwm(id)) {
    pre = PWM->PWM_CH_NUM[id].PWM_CMR & PWM_CMR_CPRE_Msk;  // Channel clock prescaler
  
//  printf("PWM get clock: channel_pre = %lu", pre);
  
    switch (pre)
    {
      case PWM_CMR_CPRE_CLKA:
        div = PWM_CLK_DIVA_GET(PWM->PWM_CLK);
//       printf(" clocka div = %lu", div);
        if (div)  // if div=0 then clock not set, so return 0
          {
          pre = PWM_CLK_PREA_GET(PWM->PWM_CLK);
//          printf(" clocka pre = %lu\n", pre);
          if (pre < PWM_CLOCK_PRE_MAX)
            res = freq_from_prescaler(pre)/ div;
//        res = (PWM_MAX_CLOCK / pwm_prescalers( pre ))/ div;
          Assert(freq_from_prescaler(pre) == (PWM_MAX_CLOCK / pwm_prescalers( pre )));
          // FIXME: Just for testing to check math
          }
        break;
      case PWM_CMR_CPRE_CLKB:
        div = PWM_CLK_DIVB_GET(PWM->PWM_CLK);
        if (div)  // if div=0 then clock not set, so return 0
          {
          pre = PWM_CLK_PREB_GET(PWM->PWM_CLK);
          if (pre < PWM_CLOCK_PRE_MAX)
            res = freq_from_prescaler(pre)/ div;
          }
        break;
      default:
        if (pre < PWM_CLOCK_PRE_MAX)
          res = freq_from_prescaler(pre) ;  // divisor of MCK
    }
  } else {
#ifdef TIMER_PWM
    return tc_pwm_get_clock(id);
#endif  
  }
  return res;
}


/* 
 TODO: PWM Clock allocation -
 If ask for a clock already available (one of prescaller dividers, or matches clocka or b) - then give them that
 Otherwise either allocate custom clock or give them a prescaller clock
   Greedy - Give custom clock if one available
  Keep track of what channels using what clock
    If no channels using a custom clock, then consider it available for (re)use
    Use count

  Problem - eLua won't let me feed it a 0 frequency
  
  if clock == 0
    unuse previous clock;
  
  if clock == clocka
    Add another user of clocka
  if clock == clockb
    Add another user of clockb
  prescale = pwm_find_clock_prescaler(clock);
  if (freq_from_pre(prescaler) == clock )
    add user of appropriate division
  if clocka available
    use it
  if clockb available
    use it
  Make do with closest match
    how close is prescaler vs clocka vs clockb
 */

// Set the PWM clock
u32 platform_pwm_set_clock( unsigned id, u32 clock )
{
  platform_pwm_stop(id);
  if (pwm_id_is_pwm(id)) {
    if (clock)
    {
      // FIXME: Should disable any active PWM channels before setting clock
      // FIXME: Allow use clockb and fixed divisors
      //  e.g. keep track of clock value settings (and accept 2 different values, plus using divisions of mck)
      pwm_clock.ul_clka = clock;
      pwm_clock.ul_clkb = 0;          // FIXME: Should already be 0, but just to be sure
      pwm_clock.ul_mck = CPU_FREQUENCY;
      if(pwm_init(PWM, &pwm_clock))
        return 0;
      // FIXME: Need to find out what clock actually set

      if (pwm_chan_clock[id] == 0) pwm_clka_users++;        // Increment use count if wasn't already using
      
      // FIXME: Returns wrong value 
      // *** Problem is it doesn't assign a clock to channel until init channel, 
      // so although clocka is set, we are reading giberish.
      // (So why is it returning system clock value?)
      
      pwm_chan_clock[id] = platform_pwm_get_clock(id);
      pwm_chan_pre[id] = PWM_PRE_CLOCKA;
    }
    else
      if (pwm_chan_clock[id])           // Clearing clock on channel that was in use
      {
      pwm_chan_clock[id] = 0;
      pwm_clka_users--;         // FIXME: Should reduce count for a or b depending which was in use
      }
    Assert(pwm_clka_users < NUM_PWM);
  }
#ifdef TIMER_PWM
  else
    return tc_pwm_set_clock(id, clock);
#endif
  return pwm_chan_clock[id];
//  return clock; // FIXME - what is it supposed to return?
}



static pwm_channel_t pwm_inst;

// TODO: Check how other platforms work, should there be way to change duty cycle without having to restart?


