ecdr/elua/src/platform/sam34/platform.c
/*
 * Configure a PWM channel to run at "frequency" Hz with a duty cycle of
 * "duty" (0-100).  0 means low all the time, 100 high all the time.
 * Return actual frequency set.
 */
//duty - PWM channel duty cycle, specified as integer from 0 to 100 (percent).
u32 platform_pwm_setup( unsigned id, u32 frequency, unsigned duty )
{
//  pwm_channel_t pwm_inst;
  u32 pwmclk;        // base clock frequency for PWM counter
  u32 period;        // number of base clocks per cycle
  u32 duty_clocks;    // number of base clocks to be high (low?) for
  
  if (id >= NUM_PWM || duty > 100 || pwm_chan_clock[id] == 0) return 0;

  if (pwm_id_is_pwm(id)) {
    //Had tried enabling pin after channel init, but some examples showed it before, so trying it here
    if (pwm_enable_pin(id))
      return 0; // Error

    pwmclk = platform_pwm_get_clock( id );
    
    // Compute period and duty period in clock cycles.
    //
    // PWM output wave frequency is requested in Hz, but programmed as a
    // number of cycles of the master PWM clock frequency.
    //
    // Here, we use rounding to select the numerically closest available
    // frequency and return the closest integer in Hz to that.

    // FIXME: from a different platform, check whether for center or left alligned
    period = (pwmclk + frequency/2) / frequency;
    if (period == 0) period = 1;  
    if (period > PWM_MAX_PERIOD) period = PWM_MAX_PERIOD;
    duty_clocks = (period * duty + 50) / 100;

    // For debugging
    //printf("PWM Setup: period = %u, duty clocks = %u\n", period, duty_clocks);

    // Put known value in all the other fields that example did not cover.
    // Or tell it to start whole structure as 0
    // FIXME: Find out right values for all of these
    pwm_inst.b_deadtime_generator = 0;
    pwm_inst.b_pwmh_output_inverted = 0;
    pwm_inst.b_pwml_output_inverted = 0;
    pwm_inst.us_deadtime_pwml = 0;
    pwm_inst.us_deadtime_pwmh = 0;
    pwm_inst.output_selection.b_override_pwmh = 0;
    pwm_inst.output_selection.b_override_pwml = 0;
    pwm_inst.output_selection.override_level_pwmh = 0;
    pwm_inst.output_selection.override_level_pwml = 0;
    pwm_inst.b_sync_ch  = 0;
    pwm_inst.ul_fault_output_pwmh = 0;
    pwm_inst.ul_fault_output_pwml = 0;
    pwm_inst.fault_id = 0;

    // Fields actually covered by examples
    pwm_channel_disable(PWM, pwm_chan[id]);  
    pwm_inst.ul_prescaler = PWM_CMR_CPRE_CLKA;    // FIXME: Should be whichever clock/prescaler selected
    pwm_inst.channel = pwm_chan[id];
    pwm_inst.ul_period = period;
    pwm_inst.ul_duty = duty_clocks;
    pwm_inst.alignment = PWM_ALIGN_LEFT;
    pwm_inst.polarity = PWM_LOW;                // Start low
    if(pwm_channel_init(PWM, &pwm_inst))
      return 0; // Error
    return (pwmclk + period/2) / period;
  }
#ifdef TIMER_PWM
  else
    return tc_pwm_setup(id, frequency, duty);
#endif
  return 0; // Error
}
//  TODO: Other bits from example code - consider
// PWM_CMR_CPRE_CLKB


// TODO: Should there be way to test channel status?
//uint32_t bitmask = pwm_channel_get_status(PWM)


void platform_pwm_start( unsigned id )
{
//  if ( pwm_chan_clock[id] )
  if (pwm_id_is_pwm(id)) 
    pwm_channel_enable(PWM, pwm_chan[id]);
#ifdef TIMER_PWM
  else
    tc_pwm_start(id);
#endif
}


void platform_pwm_stop( unsigned id )
{
  if (pwm_id_is_pwm(id))
    pwm_channel_disable(PWM, pwm_chan[id]);
#ifdef TIMER_PWM
  else
    tc_pwm_stop( id );
#endif
}

#undef pwm_prescalers

#endif // NUM_PWM > 0


// *****************************************************************************
// ADC specific functions and variables

#ifdef BUILD_ADC

// 16 ADC channels, plus Temperature


// Pins

//#define PIO_PA3X1_WKUP1      (1u << 3)  /**< \brief Adc signal: AD1/WKUP1 */
//#define PIO_PB21X1_WKUP13    (1u << 21) /**< \brief Adc signal: AD14/WKUP13 */
//#define PIO_PA11B_ADTRG      (1u << 11) /**< \brief Adc signal: ADTRG */

/*  PIOs mapping handled automatically
const struct sam_pin_config adc_pins[] = {
  {PIO_PA2_IDX, (PIO_DEFAULT)}   // AD0
  {PIO_PA3_IDX, (PIO_DEFAULT)}   // AD1
  {PIO_PA4_IDX, (PIO_DEFAULT)}   // AD2
  {PIO_PA6_IDX, (PIO_DEFAULT)}   // AD3
  {PIO_PA22_IDX, (PIO_DEFAULT)}   // AD4
  {PIO_PA23_IDX, (PIO_DEFAULT)}   // AD5
  {PIO_PA24_IDX, (PIO_DEFAULT)}   // AD6
  {PIO_PA16_IDX, (PIO_DEFAULT)}   // AD7
  {PIO_PB12_IDX, (PIO_DEFAULT)}   // AD8
  {PIO_PB13_IDX, (PIO_DEFAULT)}   // AD9
  {PIO_PB17_IDX, (PIO_DEFAULT)}   // AD10
  {PIO_PB18_IDX, (PIO_DEFAULT)}   // AD11
  {PIO_PB19_IDX, (PIO_DEFAULT)}   // AD12
  {PIO_PB20_IDX, (PIO_DEFAULT)}   // AD13
  {PIO_PB21_IDX, (PIO_DEFAULT)}   // AD14
  };
*/

// FIXME: fix ADC_TIMER_IDs (they are arbitrarily set for now)
#define ADC_TIMER_FIRST_ID 8
#define ADC_NUM_TIMERS 1

/** Reference voltage for ADC, in mv. */
#define VOLT_REF        (3300)

// Could be useful const (either this or # bits)
#define MAX_DIGITAL     (4095)


// TODO: See what did with LM4F on temperature sensor

// Temperature sensor - channel 15, 0 to 3.3 v, hence ADVREF must be set to 3300mv
// TSON bit in ADC_ACR
//		f_temp = (float)(l_vol - 800) * 0.37736 + 27.0;

// Constant: THERMOMETER
#define ADC_THERM_ID  ADC_TEMPERATURE_SENSOR


/*
static enum adc_channel_num_t adc_channel(unsigned id)
{
  return id;
}
*/

int platform_adc_check_timer_id( unsigned id, unsigned adc_timer_id )
{
  return ( ( adc_timer_id >= ADC_TIMER_FIRST_ID ) && ( adc_timer_id < ( ADC_TIMER_FIRST_ID + ADC_NUM_TIMERS ) ) );
}


// Given ADC reading taged with channel number - get just the channel number
static inline u8 chan_num(u32 adc_val)
{
  return ((adc_val & ADC_LCDR_CHNB_Msk) >> ADC_LCDR_CHNB_Pos);
}


// FIXME: Incomplete

// Handle ADC interrupts
void ADC_Handler( void )
{
  elua_adc_dev_state *d = adc_get_dev_state( 0 );
  elua_adc_ch_state *s = d->ch_state[ d->seq_ctr ]; // FIXME: This is almost shurely wrong

	uint32_t i;
	uint32_t adctemp;
	uint8_t ch_num;

  if ((adc_get_status(ADC) & ADC_ISR_DRDY) == ADC_ISR_DRDY) {
		adctemp = adc_get_latest_value(ADC);
    ch_num = chan_num(adctemp);
  
//  for (d->seq_ctr = 0; d->seq_ctr < d->seq_len ; d->seq_ctr++ )
//   s = d->ch_state[ d->seq_ctr ];
//    get fresh data for s, or if data available for s

