ecdr/elua/src/platform/sam34/platform.c
    // Need to fetch data from any channels 
UNUSED(i);
UNUSED(ch_num);
  
/*
		for (i = 0; i < NUM_CHANNELS; i++) {
      if (g_adc_sample_data.uc_ch_num[i] == ch_num) {
				g_adc_sample_data.us_value[i] = (temp & ADC_LCDR_LDATA_Msk);
				g_adc_sample_data.us_done |= 1 << i;
			}
		}
*/

    s->value_fresh = 1;

    if ( s->logsmoothlen > 0 && s->smooth_ready == 0)
      adc_smooth_data( s->id );
#if defined( BUF_ENABLE_ADC )
    else if ( s->reqsamples > 1 )
    {
      buf_write( BUF_ID_ADC, s->id, ( t_buf_data* )s->value_ptr );
      s->value_fresh = 0;
    }
#endif

    // If we have the number of requested samples, stop sampling
    if ( adc_samples_available( s->id ) >= s->reqsamples && s->freerunning == 0 )
      platform_adc_stop( s->id );
      
  };

  // Only attempt to refresh sequence order if still running
  // This allows us to "cache" an old sequence if all channels
  // finish at the same time
  if ( d->running == 1 )
    adc_update_dev_sequence( 0 );

  if ( d->clocked == 0 && d->running == 1 )
  {
    // Need to manually fire off sample request in single sample mode
//    MAP_ADCProcessorTrigger( ADC_BASE, d->seq_id );
  }    
}
//ADC_ISR_DRDY
//ADC_ISR_RXBUFF

//			while ((adc_get_status(ADC) & ADC_ISR_DRDY) != ADC_ISR_DRDY);
//			ulValue = adc_get_latest_value(ADC);
 
 
// 		adc_read_buffer(ADC, gs_s_adc_values, BUFFER_SIZE)
//  	adc_enable_interrupt(ADC, ADC_ISR_RXBUFF);



static void adcs_init( void )
{
  unsigned id;
//  elua_adc_dev_state *d = adc_get_dev_state( 0 );
  
	pmc_enable_periph_clk(ID_ADC);

#ifdef ADC_TEMP  
  // TODO: constant for ADC channel #
  
	/* Enable channel for temperature sensor. */
	adc_enable_channel(ADC, ADC_TEMPERATURE_SENSOR);

	/* Enable the temperature sensor. */
	adc_enable_ts(ADC);
#endif //ADC_TEMP

//  adc_enable_channel( ADC, ulChannel );

  for( id = 0; id < NUM_ADC; id ++ )
    adc_init_ch_state( id );

// Should set ADC int priority also

  /* Enable Data ready interrupt. */
  adc_enable_interrupt(ADC, ADC_IER_DRDY);

  /* Enable ADC interrupt. */
  NVIC_EnableIRQ(ADC_IRQn);

  // Perform sequencer setup
  platform_adc_set_clock( 0, 0 );
}


	/*
	 * Formula: ADCClock = MCK / ( (PRESCAL+1) * 2 )  [PRESCAL 0 to 255 ]
	 * For example, MCK = 64MHZ, PRESCAL = 4, then:
	 *     ADCClock = 64 / ((4+1) * 2) = 6.4MHz;
 	 */

   /*
    * MCK = 80MHZ, prescal = 4 -> ADC clock = 8 MHz
    * Settling time = 3 / 8 MHz = 375 ns (Min is 200 ns) 
    */
   /*
    *   [settling 0 = 3/  ADC clock (15 MHz or less), 
    *   [settling 1 = 5/  ADC clock (25 MHz or less),
    *   [settling 2 = 9/  ADC clock (45 MHz or less), // So this should work with any prescaler on 80Mhz part
    *   [settling 3 = 17/ ADC clock (85 Mhz or less)
    *   ADC clock limit = n/200 ns -> ADC clock * 200 ns = n, then look for next larger n
    *  settling[] = {3, 5, 9, 17}
    *  setl = ADC clock / 5000000; // (same as * 200 ns)
    *  look up setl in settling, return the index in settling (0, 1, 2, 3)
    */
   // Sampling freq 0.05 to 1 MHz
   // t Startup (Off to normal 30 us typ, 40 us max; Standby to normal 8 us typ, 12 us max)
   //   startup value = ADCClock * 40 us (for off, or 12 us for standby)
   // track time - min 160 ns
   //  TRACKTIM = ( 160 ns * ADCClock ) - 1
   // t convert typ 20 T CP_ADC
   // t settle - min 200 ns
// What limit on transfer time?

// Minimum tracking time - 160 ns
#define MIN_TRACK  (0.000000160)
#define MIN_SETTLE (0.000000200)

// FIXME: 40 microseconds (may actually only need 12 us)
#define MAX_STARTUP (0.000040)


	/* Set ADC clock. */
	/* Formula:
	 *     Startup  Time = startup value / ADCClock
	 *     Transfer Time = (TRANSFER * 2 + 3) / ADCClock
	 *     Tracking Time = (TRACKTIM + 1) / ADCClock
	 *     Settling Time = settling value / ADCClock
	 * For example, ADC clock = 6MHz (166.7 ns)
	 *     Startup time = 512 / 6MHz = 85.3 us
	 *     Transfer Time = (1 * 2 + 3) / 6MHz = 833.3 ns
	 *     Tracking Time = (0 + 1) / 6MHz = 166.7 ns
	 *     Settling Time = 3 / 6MHz = 500 ns
	 */
	/* Initialize ADC. */
	/*  startup = 8:    512 periods of ADCClock
	 * for prescale = 4
	 *     prescale: ADCClock = MCK / ( (PRESCAL+1) * 2 ) => 64MHz / ((4+1)*2) = 6.4MHz
	 *     ADC clock = 6.4 MHz
	 */

u32 platform_adc_set_clock( unsigned id, u32 frequency )
{
  elua_adc_dev_state *d = adc_get_dev_state( 0 );
  u32 tracktime;
  
  if ( frequency > 0 )
  {
    d->clocked = 1;
    u8 pre = (CPU_FREQUENCY/frequency / 2) - 1;
    u32 adcClock = CPU_FREQUENCY / ((pre + 1) * 2);
    uint8_t startup = MAX_STARTUP * adcClock;

    //  adc_init(ADC, CPU_FREQUENCY, 6400000, 8 );
    adc_init(ADC, CPU_FREQUENCY, frequency, startup );

    tracktime = ( MIN_TRACK * adcClock ) - 1;
    
    adc_configure_timing(ADC, tracktime, ADC_SETTLING_TIME_2, 1); // track time, settle time, transfer time
    // Examp had settling time 3 (not sure why)
    // Why were tracking time 0, transfer time 1 in example?

//	adc_configure_trigger(ADC, ADC_TRIG_SW, 0);  // ADC_TRIG_TIO_CH_0-2

  // Checks ADC settings, prints error messages if problems
    adc_check(ADC, CPU_FREQUENCY);
    
    adc_configure_trigger(ADC, ADC_TRIG_SW, 0);	/* Disable hardware trigger. */ 

    frequency = adc_get_actual_adc_clock(ADC, CPU_FREQUENCY);
  }
  else
  {
    d->clocked = 0;
    // Conversion will run back-to-back until required samples are acquired
    adc_configure_trigger(ADC, ADC_TRIG_SW, 1);
  }
  
	/* Enable channel number tag. */
	adc_enable_tag(ADC);

  return frequency;
}


enum adc_channel_num_t ch_list[NUM_ADC] = { 0 };


int platform_adc_update_sequence( void )
{
  elua_adc_dev_state *d = adc_get_dev_state( 0 );

  // For each channel in sequence
  for (d->seq_ctr = 0; d->seq_ctr < d->seq_len-1 ; d->seq_ctr++)
  {
    adc_enable_channel( ADC, d->ch_state[ d->seq_ctr ]->id );
    // Pin config happens automatically
    ch_list[d->seq_ctr] = d->ch_state[ d->seq_ctr ]->id;
  }

  /* Set user defined channel sequence. */
  adc_configure_sequence(ADC, ch_list,  d->seq_len);
  
  d->seq_ctr = 0;
  return PLATFORM_OK;
}


int platform_adc_start_sequence( void )
{
  elua_adc_dev_state *d = adc_get_dev_state( 0 );
  
  if( d->running != 1 ) // If already running, changes will be picked up at interrupt
  {
    adc_update_dev_sequence( 0 );

