ecdr/elua/src/platform/sam34/platform.c
    d->running = 1;
    if( d->clocked == 1 )
    {
//      MAP_TimerControlTrigger(timer_base[d->timer_id], TIMER_A, true);
//      MAP_TimerEnable(timer_base[d->timer_id], TIMER_A);
    }
    else
    {
//      MAP_ADCProcessorTrigger( ADC_BASE, d->seq_id );
        adc_configure_trigger(ADC, ADC_TRIG_SW, 1);  // Free running
        adc_start(ADC); 	/* Start conversion. */
    }

// FIXME: Not sure where rest of this should go
    /* Enable sequencer. */
    adc_start_sequencer(ADC);
  }
  
  return PLATFORM_OK;
}

void platform_adc_stop( unsigned id )
{
  elua_adc_ch_state *s = adc_get_ch_state( id );
  elua_adc_dev_state *d = adc_get_dev_state( 0 );
  
  s->op_pending = 0;
  INACTIVATE_CHANNEL(d, id);
  
  // If there are no more active channels, stop the sequencer
  if( d->ch_active == 0 )
  {
    adc_stop_sequencer(ADC);
    d->running = 0;
  }

//	adc_disable_channel(ADC, adc_channel(id));
//  adc_stop(ADC);
}

#endif // ifdef BUILD_ADC


// ****************************************************************************
// Support for specific onboard devices 

// ****************************************************************************
// Ethernet functions
#ifdef BUILD_UIP

#warning Ethernet - platform driver not written.

#endif // BUILD_UIP


// ****************************************************************************
// USB functions

// TODO: Clean up (remove extra functions)

// TODO: see if can get CDC_STDIO working (works with USB CDC)
//   CDC_STDIO - get unrecognized device, with VID and PID 0

#if defined( BUILD_USB_CDC )

static void usb_init( void )
{
// From stdio_usb example
  	// Initialize interrupt vector table support.
	irq_initialize_vectors();

	// Enable interrupts
	cpu_irq_enable();

#ifdef USB_CDC_STDIO  
  stdio_usb_init();
#else  
	// Initialize the sleep manager
//	sleepmgr_init();
  
  udc_start();
// * Add to the main IDLE loop:
// *     sleepmgr_enter_sleep(); // Optional

#endif  
}

#ifdef USB_CDC_STDIO

#warning building USB_CDC_STDIO - this does not work yet

void platform_usb_cdc_send( u8 data )
{
//  putchar(data);
  printf("%c", data);   // FIXME: Probably simpler function to use - copied this from example
}

int platform_usb_cdc_recv( timer_data_type timeout )
{
  char ch;
  
//  return getchar();
  scanf("%c",&ch);    // FIXME: Probably simpler function to use - copied this from example
  return ch;
}

#else


static volatile bool platform_cdc_enable_flag = false;

  
void platform_usb_cdc_send( u8 data )
{
  if (platform_cdc_enable_flag)
  {
    if (!udi_cdc_is_tx_ready()) {
			// Fifo full
			udi_cdc_signal_overrun();
		} else {
      udi_cdc_putc(data);
    };
  };
}


int platform_usb_cdc_recv( timer_data_type timeout )
{
  if (platform_cdc_enable_flag){
    if (0 == timeout)
      if (udi_cdc_is_rx_ready())  // No waiting - so get character if available
        return udi_cdc_getc();   
      else
        return -1;      // No character available, so return immediately (FIXME: Check return value)
    else
      return udi_cdc_getc();    // FIXME: Need to implement a timeout on this wait
  } else 
    return -1;
}


// TODO: Most of these callbacks are not needed - copied from example, but do nothing, could get rid of
void platform_suspend_action(void)
{
//	ui_powerdown();
}

void platform_resume_action(void)
{
//	ui_wakeup();
}

void platform_sof_action(void)
{
	if (!platform_cdc_enable_flag)
		return;
//	ui_process(udd_get_frame_number());
}

bool platform_cdc_enable(void)
{
	platform_cdc_enable_flag = true;
//	platform_port_open = 0;
	return true;
}

void platform_cdc_disable(void)
{
	platform_cdc_enable_flag = false;
}

void platform_cdc_set_dtr(bool enable)
{
	if ( enable ) {
		// Host terminal has open COM
//		platform_port_open |= 1 << port;
//		ui_com_open(port);
	}else{
		// Host terminal has close COM
//		platform_port_open &= ~(1 << port);
//		ui_com_close(port);
	}
}


void platform_cdc_rx_notify(void)
{
// TODO: Could do some buffering, or something
}


#endif // USB_CDC_STDIO

#else

// Callbacks needed even when don't use USB - just to make the library happy
// TODO: Could remove if build system would not build the USB library when not asked for

bool platform_cdc_enable(void)
{
  return true;
}

void platform_cdc_disable(void)
{
}

void platform_cdc_rx_notify(void)
{
}

#endif // BUILD_USB_CDC


// ****************************************************************************
// Flash access functions

#ifdef BUILD_WOFS

#warning WOFS not tested

// INTERNAL_FLASH_START_ADDRESS, INTERNAL_FLASH_SIZE
#ifdef IFLASH0_SIZE
#define IFLASH0_END (IFLASH0_ADDR + IFLASH0_SIZE)
#endif

#ifdef IFLASH1_SIZE
#define IFLASH1_END (IFLASH1_ADDR + IFLASH1_SIZE)
#endif

// Wait cycles copied from example
#define FLASH_WAIT_CYCLES 6

// FIXME: Should use an enum, or some other way to designate multiple flash banks
#define IFLASH0 1
#define IFLASH1 2

/* Unlock entire flash
	ul_error = flash_unlock(IFLASH_ADDR, (IFLASH_ADDR + IFLASH_SIZE - 1), 0, 0);
	if (FLASH_RC_OK != ul_error) {
		puts("Unlock internal flash failed.\r\n");
		return 0;
	}
  */
  
int platform_flash_init( void )
{
 // Set access mode, wait cycles
  return (flash_init(FLASH_ACCESS_MODE_128, FLASH_WAIT_CYCLES) == FLASH_RC_OK) 
    ? PLATFORM_OK : PLATFORM_ERR;
}

static u8 flash_bank(u32 addr)
{
  if ((IFLASH0_ADDR <= addr) && (addr <= IFLASH0_END))
    return IFLASH0;
  if ((IFLASH1_ADDR <= addr) && (addr <= IFLASH1_END))
    return IFLASH1;   // FIXME: Need to define return values
  return PLATFORM_ERR;
}

// TODO: Check for crossing bank boundary (and handle appropriately)
u32 platform_s_flash_write( const void *from, u32 toaddr, u32 size )
{
  u32 result;

 if ( flash_bank(toaddr) != flash_bank(toaddr + size))
    return PLATFORM_ERR;  // FIXME: Really should do in 2 parts
	result = flash_write(toaddr, from, size, 1);  // Last arg - 1 if erase first
  return (result == FLASH_RC_OK) ? PLATFORM_OK : PLATFORM_ERR;
}

int platform_flash_erase_sector( u32 sector_id )
{
//  return (flash_erase_sector(sector_id) == FLASH_RC_OK) ? PLATFORM_OK : PLATFORM_ERR;
// FIXME: ?? Thought from example that above would be code, but not defined for SAM3X??
  return PLATFORM_ERR;
}

#endif // #ifdef BUILD_WOFS


// ****************************************************************************
// Platform specific shell command(s)
#if defined(BUILD_SHELL_REFLASH)

#include "shell.h"


static void restart_bootloader(void)
{
  flash_clear_gpnvm(1);   // Next time boot from ROM

  // reset processor and periphirals (register address from cmsis)
  asm ("dsb"); // Ensure completion of memory access
  // reboot - set key, reset perrst (peripherals) and procrst (processor)
  REG_RSTC_CR = RSTC_CR_KEY(0xa5) | RSTC_CR_PERRST | RSTC_CR_PROCRST;
  asm ("dsb"); // Ensure completion of memory access
  while (1);  // Wait for reset

  //  NVIC_SystemReset();     // This way of doing reset did not work (to make it boot from ROM)
}


const char shell_help_reflash[] = "\n"
  "Restart to the bootloader, ready to flash new program.\n";
const char shell_help_summary_reflash[] = "back to bootloader";

