ecdr/elua/src/platform/sam34/platform.c
void platform_shell_reflash( int argc, char **argv )
{
  if( argc != 1 )
  {
    SHELL_SHOW_HELP( reflash );
    return;
  }
  printf( "Reflash - restarting from ROM bootloader\n" );

  restart_bootloader();
}


#endif


// ****************************************************************************
// Platform specific modules go here


// ****************************************************************************
// Random sequence generator

#ifdef BUILD_RAND

#include "module_rand.h"

// TODO: Add buffer (so can generate ahead of need)
// TODO: Add interface to check if number available

// Indicate if need to arrange to call rand_init - maybe should just call in system init(?)
static u8 f_rand_init = false;

#ifdef RAND_BUF

#warning Rand buffer not finished

//static u8 buf_space = true;
//static u32 rand_buffer;

static fifo_desc_t rand_fifo;

#define RAND_BUF_SIZE 16

static u8 rand_buf[RAND_BUF_SIZE];

void TRNG_Handler(void)
{
	u32 status;
  u32 rand; // make this a union (u32 and array of u8)

  status = trng_get_interrupt_status(TRNG);
  
  if ((status & TRNG_ISR_DATRDY) == TRNG_ISR_DATRDY) {
    if (fifo_is_full(&rand_fifo))
      disable TRNG interrupt
    else {
      rand = trng_read_output_data(TRNG)
      for (i = 0; i < 4; i++)
        if (fifo_push_uint8(&rand_fifo, rand[i]) == FIFO_ERROR_OVERFLOW){
          disable TRNG int
          break;
        }
    }
  }
  
/*  if (buf_space)
  {
    if ((status & TRNG_ISR_DATRDY) == TRNG_ISR_DATRDY) {
      buf_space = false;
      rand_buffer = trng_read_output_data(TRNG);
    }
  }
 */
  
}
#endif


u8 platform_rand_init( void )
{
  if ( !f_rand_init ) {
    pmc_enable_periph_clk(ID_TRNG);
    trng_enable(TRNG);

	/* Enable TRNG interrupt */
  /*
	NVIC_DisableIRQ(TRNG_IRQn);
	NVIC_ClearPendingIRQ(TRNG_IRQn);
	NVIC_SetPriority(TRNG_IRQn, RAND_INT_PRI);
	NVIC_EnableIRQ(TRNG_IRQn);
	trng_enable_interrupt(TRNG);
 */
#ifdef RAND_BUF
    if (fifo_init(&rand_fifo, rand_buf, RAND_BUF_SIZE) == FIFO_ERROR)
      return FALSE;
#endif
    f_rand_init = true;    
  }
  return TRUE;
}

// TODO: Fetch given number bytes from random sequence next(n) 
u32 platform_rand_next( void )
{
  if ( !f_rand_init )
    platform_rand_init();

  WAIT_WHILE(!trng_get_interrupt_status(TRNG));
  return trng_read_output_data(TRNG);
}


#endif // BUILD_RAND
